app/controllers/empresas_controller.rb

SELECT "empresas".* FROM "empresas"
---
  def index
    @empresas = Empresa.all

INSERT INTO "empresas" ("created_at", "direccion", "email", "nombre", "rif", "telefono", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @empresa = Empresa.new(empresa_params)

    respond_to do |format|
      if @empresa.save

DELETE FROM "empresas" WHERE "empresas"."id" = ?  [["id", 1]]
---
  def destroy
    @empresa.destroy

SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT 1  [["id", "delete"]]
---
    def set_empresa
      @empresa = Empresa.find(params[:id])