app/controllers/tipo_equipos_controller.rb

  def index
    @tipo_equipos = TipoEquipo.all
---
SELECT "tipo_equipos".* FROM "tipo_equipos"

  def create
    @tipo_equipo = TipoEquipo.new(tipo_equipo_params)

    respond_to do |format|
      if @tipo_equipo.save
---
INSERT INTO "tipo_equipos" ("created_at", "descripcion", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 30 Mar 2014 21:32:26 UTC +00:00], ["descripcion", "ewfwefw\r\n"], ["nombre", "holaaaa"], ["updated_at", Sun, 30 Mar 2014 21:32:26 UTC +00:00]]

  def destroy
    @tipo_equipo.destroy
---
DELETE FROM "tipo_equipos" WHERE "tipo_equipos"."id" = ?  [["id", 1]]

    def set_tipo_equipo
      @tipo_equipo = TipoEquipo.find(params[:id])
---
SELECT "tipo_equipos".* FROM "tipo_equipos" WHERE "tipo_equipos"."id" = ? LIMIT 1  [["id", "1"]]